code/security-ws/output/encrypt-decrypt/new-request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns4:processCheese xmlns:ns2="http://www.w3.org/2000/09/xmldsig#"
                           xmlns:ns3="http://www.w3.org/2001/04/xmlenc#"
                           xmlns:ns4="http://encryption.security.fuse.jboss.org">
            <arg0>belgium</arg0>
        </ns4:processCheese>
    </soap:Body>
</soap:Envelope>
